Revit 2027 API
ExternalServices.BuiltInExternalServices.ExternalResourceUIService Property
 The external UI service Id which permits registration of an alternate servers for managing error messages which happen at the loading of the references to external resources such as linked files.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ExternalResourceUIService { get; }
Public Shared ReadOnly Property ExternalResourceUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ExternalResourceUIService {
	ExternalServiceId^ get ();
}
static member ExternalResourceUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace